# MultiIndex DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
addresses = [
    ("101 Hanumanpet", "Hyderabad", "TS", "500047"),
    ("503 Marredpally", "Secunderabad", "TS", "500026"),
    ("103 Musheerabad", "Hyderabad", "TS", "500020")
]

In [6]:
pd.MultiIndex.from_tuples(addresses)
pd.MultiIndex.from_tuples(tuples=addresses,
                          names=["Street", "City", "State", "Zip"])

MultiIndex([( '101 Hanumanpet',    'Hyderabad', 'TS', '500047'),
            ('503 Marredpally', 'Secunderabad', 'TS', '500026'),
            ('103 Musheerabad',    'Hyderabad', 'TS', '500020')],
           names=['Street', 'City', 'State', 'Zip'])

In [7]:
row_index = pd.MultiIndex.from_tuples(tuples=addresses,
                                       names=["Street", "City", "State", "Zip"])

In [8]:
data = [
    ['A', 'B+'],
    ['C+', 'C'],
    ['D', 'A']
]

In [9]:
pd.DataFrame(data=data, index=row_index)

                                            0   1
Street          City         State Zip
101 Hanumanpet  Hyderabad    TS    500047   A  B+
503 Marredpally Secunderabad TS    500026  C+   C
103 Musheerabad Hyderabad    TS    500020   D   A

In [10]:
columns = ["Schools", "Cost of Living"]

In [12]:
area_grades = pd.DataFrame(
    data = data,
    index= row_index,
    columns= columns
)
area_grades

                                          Schools Cost of Living
Street          City         State Zip
101 Hanumanpet  Hyderabad    TS    500047       A             B+
503 Marredpally Secunderabad TS    500026      C+              C
103 Musheerabad Hyderabad    TS    500020       D              A

In [13]:
data = [
    ["A", "C+", "B", "B+"],
    ["B", "A", "C", "C+"],
    ["B", "C", "C+", "D"]
]

In [14]:
column_index = pd.MultiIndex.from_tuples([
    ('Culture', 'Restaurants'),
    ('Culture', 'Museums'),
    ('Services', 'Police'),
    ('Services', 'Schools')
])

In [16]:
area_grades = pd.DataFrame(
    data = data,
    index = row_index,
    columns = column_index
)
area_grades

                                              Culture         Services
                                          Restaurants Museums   Police Schools
Street          City         State Zip
101 Hanumanpet  Hyderabad    TS    500047           A      C+        B      B+
503 Marredpally Secunderabad TS    500026           B       A        C      C+
103 Musheerabad Hyderabad    TS    500020           B       C       C+       D